Repository: ssube2020/TbcTask
Catalog: TbcTaskApi/Shared/ValidationResponseMessages/ResponseMessages.*.resx
Languages: ka_ge

# ValidationGeneralError
source: Validation Error
ka_ge: ვალიდაციის შეცდომა

# NameLengthError
source: Name and Surname must be between 2 and 50 characters.
ka_ge: სახელისა და გვარის სიგრძე უნდა იყოს 2-დან 50 სიმბოლომდე.

# GenderValidationError
source: Gender values can be 1 and 2
ka_ge: სქესის ვალიდური მნიშვნელობაა 1 ან 2.

# PersonalNumberValidationError
source: Personal number must be 11 chars lenght and only contain numbers
ka_ge: პირადი ნომერი უნდა იყოს 11 სიმბოლოს სიგრძის და შეიცავდეს მხოლოდ ციფრებს.

# AgeValidationError
source: Person must be 18 years or older
ka_ge: პირს უნდა ჰქონდეს 18 ან მეტი წელი.

# PhoneValidationError
source: Phone number must be betweeon 4 and 50 length and contain only numbers
ka_ge: ტელეფონის ნომერი უნდა იყოს 4-დან 50 სიმბოლომდე სიგრძის და შეიცავდეს მხოლოდ ციფრებს.

# NameLetterValidationErrorMessage
source: Name and Surname must contain only English or only Georgian letters, not both.
ka_ge: სახელი და გვარი უნდა შეიცავდეს მხოლოდ ინგლისურ ან ქართულ ასოებს, არა ორივეს ერთად.

# UserAlreadyExistsMessage
source: User with such personal number already exists.
ka_ge: ასეთი პირადი ნომრით მომხმარებელი უკვე არსებობს.

# UserNotFoundMessage
source: User with this id does not exist.
ka_ge: მომხმარებელი არ მოიძებნა.

# ConnectionExists
source: User already has such connected person.
ka_ge: მომხმარებელი უკვე დაკავშირებულია ამ პიროვნებასთან.

# ConnectionCreatedSuccess
source: User connection added succesfully
ka_ge: მომხმარებლის კავშირი წარმატებით დაემატა.

# UserDeleteSuccess
source: User deleted succesfully
ka_ge: მომხმარებელი წარმატებით წაიშალა.

# PhotoSaveError
source: Error while saving photo
ka_ge: ფოტოს შენახვისას მოხდა შეცდომა.

# PhotoUploadedSuccess
source: Photo Uploaded Successfully
ka_ge: ფოტო წარმატებით აიტვირთა.

# ConnectedPersonDoesnotExistException
source: Connected persons id's are not valid
ka_ge: დაკავშირებული პირების id-ები არასწორია.
